Revit 2024 API
SpatialElementGeometryCalculator.GetOptions Method
 The options that control the calculation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public SpatialElementBoundaryOptions GetOptions()
Visual Basic
Public Function GetOptions As SpatialElementBoundaryOptions
Visual C++
public:
SpatialElementBoundaryOptions^ GetOptions()
Return Value
 The options.
See Also
SpatialElementGeometryCalculator Class
Autodesk.Revit.DB Namespace